# Транслитерация Русский-Английский по ГОСТ 16876-71

trans = \
{
    'а': 'a',
    'б': 'b',
    'в': 'v',
    'г': 'g',
    'д': 'd',
    'е': 'e',
    'ё': 'jo',
    'ж': 'zh',
    'з': 'z',
    'и': 'i',
    'й': 'jj',
    'к': 'k',
    'л': 'l',
    'м': 'm',
    'н': 'n',
    'о': 'o',
    'п': 'p',
    'р': 'r',
    'с': 's',
    'т': 't',
    'у': 'u',
    'ф': 'f',
    'х': 'kh',
    'ц': 'c',
    'ч': 'ch',
    'ш': 'sh',
    'щ': 'shh',
    'ъ': '"',
    'ы': 'y',
    'ь': "'",
    'э': 'eh',
    'ю': 'ju',
    'я': 'ja',
    'А': 'A',
    'Б': 'B',
    'В': 'V',
    'Г': 'G',
    'Д': 'D',
    'Е': 'E',
    'Ё': 'JO',
    'Ж': 'ZH',
    'З': 'Z',
    'И': 'I',
    'Й': 'JJ',
    'К': 'K',
    'Л': 'L',
    'М': 'M',
    'Н': 'N',
    'О': 'O',
    'П': 'P',
    'Р': 'R',
    'С': 'S',
    'Т': 'T',
    'У': 'U',
    'Ф': 'F',
    'Х': 'KH',
    'Ц': 'C',
    'Ч': 'CH',
    'Ш': 'SH',
    'Щ': 'SHH',
    'Ъ': '"',
    'Ы': 'Y',
    'Ь': "'",
    'Э': 'EH',
    'Ю': 'JU',
    'Я': 'JA',
    ' ': ''
}
# print(trans)

a = ['Отношение прогнозного к текущему']
b = []
for words in a:
    new_word = ''
    for n,i in enumerate(words):
        if i in trans.keys():
            if words[n-1] == ' ' or n == 0:
                new_word += trans[i].upper()
            else:
                new_word += trans[i]
        else:
            new_word += i
    b.append(new_word)
print(b)